import React from "react";
import { FaRegUser, RiHome2Line } from "react-icons/all";
const size = 32;
const SideBarConfig = [
  {
    id: 1,
    title: "Главная",
    icon: (
      <svg width="20" height="21" viewBox="0 0 20 21">
        <path d="M19.55 8.117L10.567.157a.967.967 0 0 0-1.056 0L.528 8.117C.211 8.327 0 8.746 0 9.06v11.312c0 .314.317.628.634.628H6.34v-6.389c0-.524.423-.943.952-.943h5.389c.528 0 .951.42.951.943V21h5.706c.317 0 .635-.314.635-.628V9.06c.105-.314-.106-.838-.423-.943"></path>
      </svg>
    ),
    link: "/home",
  },
  {
    id: 2,
    title: "Мои заказы",
    icon: (
      <svg viewBox="0 0 13 10" width="16" height="16" fill="#000">
        <path d="M11.5 0L4.2 7.1 1.5 4.4 0 5.8 4.2 10 13 1.5 11.5 0"></path>
      </svg>
    ),
    link: "/orders",
  },
  {
    id: 3,
    title: "Сообщения",
    icon: (
      <svg viewBox="0 0 23 16.9" width="23" height="21">
        <path d="M20.9 0H2.1C.6 0 0 .7 0 2.2v12.5c0 1.6.6 2.2 2.1 2.2h18.8c1.5 0 2.1-.7 2.1-2.2V2.2C23 .7 22.4 0 20.9 0zm.4 13.6c.3.3-.2.8-.5 1.1-.1.2-.3.5-.5.5s-.2.1-.3-.1l-5.5-5-.6.5c-.7.6-1.6 1.1-2.4 1.1-.9 0-1.7-.4-2.4-1.1l-.6-.6-5.2 4.8c-.1.1-.3.2-.5.2s-.4-.1-.5-.2c-.3-.3-.8-1-.5-1.3l5.1-4.9-5-5c-.3-.3.1-.8.3-1.1.3-.3.8-.4 1.1-.2L10 8.9c.4.4.9.8 1.4.9.6 0 1.1-.4 1.6-.9l6.6-6.7c.3-.3.9 0 1.2.3.3.3.4 1 .2 1.2l-4.9 4.8 5.2 5.1z"></path>
      </svg>
    ),
    link: "/messages",
  },
  {
    id: 4,
    title: "Профиль",
    icon: (
      <svg viewBox="0 0 15 18.9" width="15" height="21">
        <path d="M7.5 8.8c2.6 0 4.7-2 4.7-4.4S10.1 0 7.5 0 2.8 2 2.8 4.4C2.9 6.8 5 8.8 7.5 8.8zm0 1.5c-4.2 0-7.5 3.2-7.5 7.4 0 .6.5 1.2 1.2 1.2h12.6c.7 0 1.2-.5 1.2-1.2 0-4.1-3.3-7.4-7.5-7.4z"></path>
      </svg>
    ),
    link: "/User",
  },
];

export default SideBarConfig;
